###
000000000  00000000   0000000  000000000  
   000     000       000          000     
   000     0000000   0000000      000     
   000     000            000     000     
   000     00000000  0000000      000     
###

{ expect } = require 'chai'

calc = require './calc'

describe 'calc', ->

    it 'calc', ->
        
        list = [
            ['2^2^2',   '16']
            ['2^(3^4)', '2.4178516392292583e+24']
            ['2^3^4',   '2.4178516392292583e+24']
            ['(2^3)^4', '4096']
        ]
        for l in list 
            expect(calc.calc l[0]).to.eql l[1]
        
    it 'equals', ->
        
        list = [
            ['2^2',   '=', '4']
            ['2^4',   '=', '16']
            ['2^2^2', '=', '16']
        ]
        for l in list 
            expect(calc.textKey l[0], l[1]).to.eql l[2]
    
    it 'block', ->
        
        list = [
            ['(', ')']
            ['0', '0']
            ['ℇ', '2']
            ['π', '5']
            ['', '^']
            ['', '/']
            ['', '*']
            ['', '.']
            ['1°', '5']
            ['2°', 'π']
            ['3°', 'ℇ']            
        ]
        for l in list
            expect(calc.textKey l[0], l[1]).to.eql l[0]